package math;

/* 数学切片。
 * 如果一组数包含至少3个元素，并且任意两个连续元素之差都相等，则称该序列为等差序列。
 * 给定一个以0为起始下标的数组A，包含N个数字。数组的切片是指任意满足0 <= P < Q < N的整数对 (P, Q)。
 * 数组A的切片 (P, Q) 是等差数列，如果满足下列条件：
 * A[P], A[p + 1], ..., A[Q - 1], A[Q]是等差数列。特别的，P + 1 < Q。
 * 函数应当返回数组A的等差数列切片的个数。
 * */

public class Solution413 {
	
	/* 若序列S为等差数列，其长度为N，则其等差数列切片的个数SUM = 1 + 2 + ... + (N - 2)
	 * 例如，等差数列[1, 2, 3, 4, 5, 6]的切片个数为1+2+3+4=10
	 * 这10个切片分别是：
	 * [1,2,3], [1,2,3,4], [1,2,3,4,5], [1,2,3,4,5,6], [2,3,4], [2,3,4,5], [2,3,4,5,6],
	 * [3,4,5], [3,4,5,6], [4,5,6]
	 * */
	
    public int numberOfArithmeticSlices(int[] A) {
        int curSum = 0, sum = 0;
        for (int i = 2; i < A.length; i++)
            if (A[i] - A[i-1] == A[i-1] - A[i-2]) { // 第一轮[1,2,3], [1,2,3,4], [1,2,3,4,5], [1,2,3,4,5,6]
            										// 第二轮[2,3,4], [2,3,4,5], [2,3,4,5,6]
            										// 第三轮[3,4,5], [3,4,5,6]
            										// 第四轮[4,5,6]
                curSum += 1;
                sum += curSum;
            } else {
                curSum = 0;
            }
        return sum;
    }
}
